# [LAB-02] Pandas

## #04. 데이터 확인하기

### 라이브러리 참조

In [6]:
from hossam import load_data,load_info

In [4]:
origin = load_data('GRADE')
origin

[data] https://data.hossam.kr/data/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [9]:
#데이터 차원과 크기
print('차원:', origin.ndim)
print('크기:', origin.shape)

차원: 2
크기: (9, 6)

In [ ]:
#각 필드별 데이터 타입
origin.dtypes

학년     int64
성별    object
국어     int64
영어     int64
수학     int64
과학     int64
dtype: object

In [ ]:
# 각 필드별 정보 확인 *필수
origin.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: int64(5), object(1)
memory usage: 504.0+ bytes

In [13]:
#데이터 프레임은 열 다음 행임
origin['국어']

이름
철수    98
영희    88
민철    92
수현    63
호영    75
영호    80
용식    82
나영    90
석영    91
Name: 국어, dtype: int64

In [15]:
type(origin['국어'])

pandas.core.series.Series

In [17]:
#대괄호를 이중으로 사용하여 원하는 열만 필터링 하여 데이터 프레임 생성
df2 = origin[['국어','영어','수학']]
df2

    국어   영어  수학
이름
철수  98   77  88
영희  88  120  62
민철  92   70  83
수현  63   60  31
호영  75   50  90
영호  80   88  91
용식  82   88  79
나영  90   92  81
석영  91   90  89

In [ ]:
#특정 행 데이터 추출
print(origin.loc['철수'])
print(type(origin.loc['철수']))

학년     1
성별    남자
국어    98
영어    77
수학    88
과학    64
Name: 철수, dtype: object
<class 'pandas.core.series.Series'>

In [ ]:
#특정 위치의 데이터 추출, 반복문 쓸 때 편함 데이터 프레임은 반복문 별로 안씀
origin.iloc[0]

학년     1
성별    남자
국어    98
영어    77
수학    88
과학    64
Name: 철수, dtype: object

In [23]:
origin.iloc[1:4]  #1~3번째 행까지 추출

    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71

In [25]:
#단일 값 확인하기 열->행 순서로 접근
origin['국어']['철수']

np.int64(98)

In [28]:
# 행-> 열 순서로 접근
origin.loc['철수','국어']

np.int64(98)

In [29]:
#인덱스 번호 기반 데이터 접근 행->열
origin.iloc[1,2]

np.int64(88)

In [31]:
origin.iloc[:,3] #모든 행의 3번째 열 데이터

이름
철수     77
영희    120
민철     70
수현     60
호영     50
영호     88
용식     88
나영     92
석영     90
Name: 영어, dtype: int64

In [32]:
# 값의 변경은 행->열 순으로 접근하는 경우만 가능함
origin.loc['철수','국어'] = 100
origin

    학년  성별   국어   영어  수학  과학
이름
철수   1  남자  100   77  88  64
영희   2  여자   88  120  62  72
민철   1  남자   92   70  83  79
수현   3  여자   63   60  31  71
호영   4  남자   75   50  90  88
영호   4  남자   80   88  91  72
용식   2  남자   82   88  79  90
나영   1  여자   90   92  81  95
석영   1  남자   91   90  89  80

In [33]:
#상위 n건 확인
origin.head(2)

    학년  성별   국어   영어  수학  과학
이름
철수   1  남자  100   77  88  64
영희   2  여자   88  120  62  72

In [34]:
#하위 n건 확인
origin.tail(2)

    학년  성별  국어  영어  수학  과학
이름
나영   1  여자  90  92  81  95
석영   1  남자  91  90  89  80

In [48]:
origin.sum()

학년                    19
성별    남자여자남자여자남자남자남자여자남자
국어                   761
영어                   735
수학                   694
과학                   711
dtype: object

In [ ]:
# 컬럼 단위로 모든 기술을 일괄 산출
origin['국어'].describe()

count      9.000000
mean      84.555556
std       10.955719
min       63.000000
25%       80.000000
50%       88.000000
75%       91.000000
max      100.000000
Name: 국어, dtype: float64

In [38]:
df2 = origin[['국어','영어','수학','과학']]
desc = df2.describe()
desc

               국어          영어         수학         과학
count    9.000000    9.000000   9.000000   9.000000
mean    84.555556   81.666667  77.111111  79.000000
std     10.955719   20.481699  19.451507  10.283482
min     63.000000   50.000000  31.000000  64.000000
25%     80.000000   70.000000  79.000000  72.000000
50%     88.000000   88.000000  83.000000  79.000000
75%     91.000000   90.000000  89.000000  88.000000
max    100.000000  120.000000  91.000000  95.000000

In [39]:
# 전치 구하기
t = desc.T
t

    count       mean        std   min   25%   50%   75%    max
국어    9.0  84.555556  10.955719  63.0  80.0  88.0  91.0  100.0
영어    9.0  81.666667  20.481699  50.0  70.0  88.0  90.0  120.0
수학    9.0  77.111111  19.451507  31.0  79.0  83.0  89.0   91.0
과학    9.0  79.000000  10.283482  64.0  72.0  79.0  88.0   95.0

In [47]:
origin['성별'].value_counts()

성별
남자    6
여자    3
Name: count, dtype: int64

In [41]:
origin['학년'].value_counts()

학년
1    4
2    2
4    2
3    1
Name: count, dtype: int64